Similar problem with AWS Route53 records, when two aws_route53_records share the same name and you want to create either one of them. Very easy to reproduce.

main.tf:
```
resource "aws_route53_record" "foo" {
  count = 1
  name = "foo"
  records = [ "1.1.1.1" ]
  zone_id = "REDACTED"
  type = "A"
  ttl = 30
}

resource "aws_route53_record" "foo2" {
  count = 0
  name = "foo"
  records = [ "2.2.2.2" ]
  zone_id = "REDACTED"
  type = "A"
  ttl = 30
}
```

Apply:
```
❯ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.foo[0] will be created
  + resource "aws_route53_record" "foo" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "foo"
      + records         = [
          + "1.1.1.1",
        ]
      + ttl             = 30
      + type            = "A"
      + zone_id         = "REDACTED"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_route53_record.foo[0]: Creating...
aws_route53_record.foo[0]: Still creating... [10s elapsed]
aws_route53_record.foo[0]: Still creating... [20s elapsed]
aws_route53_record.foo[0]: Still creating... [30s elapsed]
aws_route53_record.foo[0]: Creation complete after 36s [id=REDACTED_foo_A]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Change `count` to 0 for `aws_route53_record.foo`, and change `count` to `1` for `aws_route53_record.foo2`, and apply again:

```
❯ terraform apply
aws_route53_record.foo[0]: Refreshing state... [id=REDACTED_foo_A]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.foo[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route53_record" "foo" {
      - fqdn                             = "foo.REDACTED" -> null
      - id                               = "REDACTED_foo_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "foo" -> null
      - records                          = [
          - "1.1.1.1",
        ] -> null
      - ttl                              = 30 -> null
      - type                             = "A" -> null
      - zone_id                          = "REDACTED" -> null
    }

  # aws_route53_record.foo2[0] will be created
  + resource "aws_route53_record" "foo2" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "foo"
      + records         = [
          + "2.2.2.2",
        ]
      + ttl             = 30
      + type            = "A"
      + zone_id         = "REDACTED"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_route53_record.foo[0]: Destroying... [id=REDACTED_foo_A]
aws_route53_record.foo2[0]: Creating...
aws_route53_record.foo[0]: Still destroying... [id=REDACTED_foo_A, 10s elapsed]
aws_route53_record.foo[0]: Still destroying... [id=REDACTED_foo_A, 20s elapsed]
aws_route53_record.foo[0]: Still destroying... [id=REDACTED_foo_A, 30s elapsed]
aws_route53_record.foo[0]: Still destroying... [id=REDACTED_foo_A, 40s elapsed]
aws_route53_record.foo[0]: Destruction complete after 47s
╷
│ Error: creating Route53 Record: operation error Route 53: ChangeResourceRecordSets, https response error StatusCode: 400, RequestID: d34f499b-8a33-44c8-a482-8a90bac6a927, InvalidChangeBatch: [Tried to create resource record set [name='foo.REDACTED.', type='A'] but it already exists]
│ 
│   with aws_route53_record.foo2[0],
│   on main.tf line 10, in resource "aws_route53_record" "foo2":
│   10: resource "aws_route53_record" "foo2" {
│ 
```

Would be nice to have some kind of a workaround for this.